modules/catalog/models/Value.php

    public static function getListEx($feature_id, $group_id)
    {
        $query = self::find();
        $query->joinWith(['feature']);
        $query->joinWith(['articles.product.groups']);
        $query->andWhere(['feature_id' => $feature_id]);
        $query->andWhere(['group_id' => $group_id]);
        $query->andWhere(['catalog_article.enabled' => true]);
        $query->andWhere(['catalog_product.enabled' => true]);
        $ids = $query->select('catalog_value.id')->groupBy(['catalog_value.id'])->column();
---
SELECT `catalog_value`.`id` FROM `catalog_value` LEFT JOIN `catalog_feature` ON `catalog_value`.`feature_id` = `catalog_feature`.`id` LEFT JOIN `catalog_article_value_ref` ON `catalog_value`.`id` = `catalog_article_value_ref`.`value_id` LEFT JOIN `catalog_article` ON `catalog_article_value_ref`.`article_id` = `catalog_article`.`id` LEFT JOIN `catalog_product` ON `catalog_article`.`product_id` = `catalog_product`.`id` LEFT JOIN `catalog_product_group_ref` ON `catalog_product`.`id` = `catalog_product_group_ref`.`product_id` LEFT JOIN `catalog_group` ON `catalog_product_group_ref`.`group_id` = `catalog_group`.`id` WHERE (`feature_id`=8) AND (`group_id`=7) AND (`catalog_article`.`enabled`=TRUE) AND (`catalog_product`.`enabled`=TRUE) GROUP BY `catalog_value`.`id`