admin/controllers/EnquiryController.php

SELECT * FROM `enquiry_form` WHERE `id`='18'
---
    protected function findModel($id)
    {
        if (!Yii::$app->user->isGuest && Yii::$app->user->identity->is_admin == 1) {
            if (($model = EnquiryForm::findOne(['id' => $id])) !== null) {