admin/views/default/index.php

    <p class="text-center text-secondary"><?= Html::encode('Добро пожаловать '.Yii::$app->user->identity->email) ?></p>
    <div class="row justify-content-center ">
        <div class="col-4 flex-wrap m-2 d-flex flex-column justify-content-center  border rounded shadow-sm">
            <h2 id="counter" class="text-danger"><?= Html::encode(\app\admin\models\FeedbackForm::find()->where(['is_solved'=>0])->count()) ?></h2>
---
SELECT COUNT(*) FROM `feedback_form` WHERE `is_solved`=0

            </p>
        </div>  -->
        <div class="col-4 m-2 d-flex flex-column justify-content-center  border rounded shadow-sm">
            <h2 class="text-primary"><?= Html::encode(\app\admin\models\MasterClass::find()->count()) ?></h2>
---
SELECT COUNT(*) FROM `master_class`

            </p>
        </div>
        <div class="col-4 m-2 d-flex flex-column justify-content-center  border rounded shadow-sm">
            <h2 class="text-primary"><?= Html::encode(\app\admin\models\Events::find()->count()) ?></h2>
---
SELECT COUNT(*) FROM `events`